Revit 2027 API
BuiltInFailures.JoinElementsFailures.CannotKeepTrussJoined Property
 Can't keep the highlighted [Element]s joined.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotKeepTrussJoined { get; }
Public Shared ReadOnly Property CannotKeepTrussJoined As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotKeepTrussJoined {
	FailureDefinitionId^ get ();
}
static member CannotKeepTrussJoined : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.JoinElementsFailures Class
Autodesk.Revit.DB Namespace